cask_args appdir: '/Applications'
tap 'caskroom/versions'

# required libs
brew 'openssl'
brew 'readline'
brew 'autoconf'
brew 'automake'
brew 'libyaml'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'

# basics
brew 'coreutils'
brew 'tree'
brew 'git'
brew 'git-lfs'
cask 'gpgtools'
cask 'github-desktop'

# shell/terminal
brew 'bash'
brew 'bash-completion'
brew 'fish'
cask 'iterm2-beta'

# http
brew 'curl'
brew 'wget'
brew 'httpie'

# clojure
cask 'java'
brew 'maven'
brew 'leiningen'
brew 'boot-clj'
brew 'planck'

# erlang/elixir
brew 'erlang'
brew 'elixir'

# node
brew 'node'
brew 'nvm'

# golang
brew 'go'
brew 'hugo'
cask 'ngrok'

# fonts
cask 'font-source-code-pro'
tap 'caskroom/fonts'

# editors
cask 'sublime-text3'
cask 'intellij-idea'
cask 'atom'

# hashicorp
cask 'terraform'
cask 'packer'

# cloud providers
brew 'awscli'
brew 'heroku-toolbelt'

# osx/productivity
cask 'flux'
cask 'caffeine'
cask 'alfred'
cask 'slack'

# browsers
cask 'google-chrome'
cask 'firefox'

# windows/wine
cask 'xquartz'
brew 'wine'

# design
cask 'sketch'
cask 'imageoptim'

# mac app store
tap 'argon/mas'
brew 'mas'
mas 'DaisyDisk', id: 411643860
mas 'Icon Slate', id: 439697913
mas 'Tweetbot for Twitter', id: 557168941
mas 'Xcode', id: 497799835
mas 'Pixelmator', id: 407963104
